# Задача No49. Решение в группах
"""

Создать телефонный справочник с возможностью импорта и экспорта данных в формате .txt.
Фамилия, имя, отчество, номер телефона - данные, которые должны находиться в файле.
1. Программа должна выводить данные
2. Программа должна сохранять данные в текстовом файле
3. Пользователь может ввести одну из характеристик для поиска определенной записи (Например имя или фамилию человека)
4. Использование функций. Ваша программа не должна быть линейной
"""


# id
# ФИО
# Дата рождения
# Номер телефона
#
# 1) Ввод нового пользователя
# 2) Поиск по характеристике -> ввод характеристики, предлагаем на выбор подходящие строчки, пользователь выбирает строку для изменения


# ДОМАШНЕЕ ЗАДАНИЕ:
# Задача 38:
"""
Дополнить телефонный справочник возможностью изменения и удаления данных. 
Пользователь также может ввести имя или фамилию, и Вы должны реализовать функционал для изменения и удаления данных
"""


# phone book - complete add, print and find contacts + 12 contacts fill